Repository: Blooym/Dalamud.GoodFriend
Catalog: src/Plugin/Localization/Resources/Strings.*.resx
Languages: es, fr, zh

# Modules_LoginStateModule_Name
source: Friend Login & Logout
es: Inicio y cierre de sesión de amigos
fr: Connexion et déconnexion des amis
zh: 好友登录 & 退出

# Modules_LoginStateModule_Description
source: Automatically send and receive notifications when friends log in or out of their characters.
es: Enviar y recibir notificaciones automáticamente cuando los amigos cierren o inicien sesión.
fr: Recevoir et envoyer une notification lors de la connexion ou déconnexion de vos amis.
zh: 当好友登录或退出他们的角色时，自动发送和接收通知。

# Modules_LoginStateModule_UI_FilteringOptions
source: Filtering Options
es: Opciones de filtro
fr: Options de filtrage
zh: 过滤选项

# Modules_LoginStateModule_UI_HideSameCompany
source: Ignore same free company
es: Ignorar misma Free Company
fr: Ignorer la même Compagnie Libre
zh: 忽略同一部队

# Modules_LoginStateModule_UI_HideSameCompany_Description
source: Ignores events from friends in the same free company as you.
es: Ignora eventos de amigos que pertenecen a la misma Free Company que tú.
fr: Ignore les événements des amis de la même compagnie libre que vous.
zh: 忽略和你同一个部队的好友事件

# Modules_LoginStateModule_UI_HideDiffHomeworld
source: Ignore different homeworld
es: Ignorar mundo de origen diferente
fr: Ignorer les mondes d'origine différents
zh: 忽略不同的初始服务器

# Modules_LoginStateModule_UI_HideDiffHomeworld_Description
source: Ignores events from friends that aren't from your homeworld.
es: Ignora eventos de amigos que no pertenecen a tu mundo de origen.
fr: Ignorer les évènements des amis n'appartenant pas à votre monde d'origine.
zh: 忽略和你不是同一个初始服务器好友的事件

# Modules_LoginStateModule_UI_HideDiffTerritory
source: Ignore different territory
es: Ignorar territorio diferente
fr: Ignorer mondes différents

# Modules_LoginStateModule_UI_HideDiffTerritory_Description
source: Ignore events from friends that logged outside of your current territory.
es: Ignorar eventos de amigos que inicien o cierren sesión en territorios diferentes al tuyo.
fr: Ignorer les événements des amis qui sont connectés en dehors de votre monde.

# Modules_LoginStateModule_UI_HideDiffWorld
source: Ignore different world
es: Ignorar mundo diferente
fr: Ignorer les mondes d'origine différents

# Modules_LoginStateModule_UI_HideDiffWorld_Description
source: Ignore events from friends that logged outside of your current world.
es: Ignorar eventos de amigos que inicien o cierren sesión en mundos diferentes al tuyo.
fr: Ignorer les événements de vos amis qui se sont connectés en dehors de votre monde actuel.

# Modules_LoginStateModule_UI_HideDiffDC
source: Ignore different datacenter
es: Ignorar datacenter diferente

# Modules_LoginStateModule_UI_HideDiffDC_Description
source: Hides events from friends that logged outside of your current datacenter.
es: Ignorar eventos de amigos que inicien o cierren sesión en un datacenter diferente al tuyo.
fr: Masque les événements des amis qui se sont connecté en dehors de votre centre de données actuel.

# Modules_LoginStateModule_UI_MessageOptions
source: Message Options
es: Opciones de mensaje
fr: Options des messages

# Modules_LoginStateModule_UI_LoginMessage
source: Login message
es: Mensaje de inicio de sesión
fr: Message de connexion

# Modules_LoginStateModule_UI_LoginMessage_Tooltip
source: Your message must contain {0} for the player's name.
es: Tu mensaje debe contener {0} para el nombre del jugador.
fr: Votre message doit contenir {0} pour le nom du joueur.

# Modules_LoginStateModule_UI_LoginMessage_Invalid
source: Invalid login message, please check your syntax.
es: Mensaje de inicio de sesión inválido, por favor compruebe la sintaxis.
fr: Message de connexion invalide, veuillez vérifier votre syntaxe.

# Modules_LoginStateModule_UI_LogoutMessage
source: Logout Message
es: Mensaje de cierre de sesión
fr: Message de déconnexion
zh: 下线消息

# Modules_LoginStateModule_UI_LogoutMessage_Invalid
source: Invalid logout message, please check your syntax.
es: Mensaje de cierre de sesión inválido, por favor compruebe la sintaxis.
fr: Message de déconnexion invalide, veuillez vérifier votre syntaxe.

# Modules_LoginStateModule_UI_LogoutMessage_Tooltip
source: Your message must contain {0} for the player's name.
es: Tu mensaje debe contener {0} para el nombre del jugador.
fr: Votre message doit contenir {0} pour le nom du joueur.

# Modules_PlayerStreamConnectionModule_Name
source: Player Stream Connection
es: Conexión de Player Stream
fr: Connexion au flux d'amis

# Modules_PlayerStreamConnectionModule_ConnectionStatus
source: Connection State:
es: Estado de Conexión:
fr: Statut de la connexion:

# Modules_PlayerStreamConnectionModule_ConnectionStatus_Connected
source: Connected
es: Conectad@
fr: Connecté
zh: 已连接

# Modules_PlayerStreamConnectionModule_ConnectionStatus_Connecting
source: Connecting...
es: Conectando...
fr: Connexion en cours...

# Modules_PlayerStreamConnectionModule_ConnectionStatus_Disconnected
source: Disconnected
es: Desconectad@
fr: Déconnecté
zh: 未连接

# Modules_PlayerStreamConnectionModule_ConnectionStatus_Disconnecting
source: Disconnecting
es: Desconectando...
fr: Déconnexion...

# Modules_PlayerStreamConnectionModule_ConnectionStatistics
source: Connection Statistics
es: Estado de Conexión
fr: Statistiques de connexion

# Modules_PlayerStreamConnectionModule_ConnectionStatistics_EventsTotal
source: Events received: {0}
es: Eventos recibidos: {0}
fr: Événements reçus: {0}
zh: Events receieved: {0}

# Modules_PlayerStreamConnectionModule_ConnectionStatistics_LastEvent
source: Last event: {0}
es: Último evento: {0}
fr: Dernier événement : {0}

# Modules_PlayerStreamConnectionModule_ConnectionStatistics_HeartbeatsTotal
source: Heartbeats received: {0}
es: Heartbeats recibidos: {0}
fr: Battements de cœur reçus : {0}
zh: Heartbeats receieved: {0}

# Modules_PlayerStreamConnectionModule_ConnectionStatistics_LastHeartbeat
source: Last heartbeat: {0}
es: Último Heartbeat: {0}
fr: Dernier battement de cœur : {0}

# Modules_InstanceInfoModule_Name
source: About Instance
es: Información de instancia
fr: À propos de l'instance

# Modules_InstanceInfoModule_MetadataFetch_Failed
source: Failed to fetch metadata, will try again later.
es: Error al obtener metadatos, se intentará de nuevo más tarde.
fr: Impossible de récupérer les métadonnées, réessayez plus tard.

# Modules_InstanceInfoModule_MetadataFetch_Fetching
source: Fetching metadata...
es: Obteniendo metadatos...
fr: Récupération des métadonnées...

# Modules_InstanceInfoModule_ConnectedClients_Count
source: There are currently {0} players online
es: Actualmente hay {0} jugadores en línea
fr: Il y a actuellement {0} joueurs en ligne

# Modules_InstanceInfoModule_CustomLinks_Title
source: Custom Links
es: Enlaces personalizados
fr: Liens personnalisés

# Modules_InstanceInfoModule_CustomLinks_Unset
source: No custom links have been set.
es: No se han establecido enlaces personalizados.
fr: Aucun lien personnalisé n'a été configuré.

# Modules_InstanceInfoModule_MetadataFetch_LastFailed
source: The last metadata update failed, currently using cached data.
es: La última actualización de metadatos falló. Actualmente se están usando datos en caché.
fr: La dernière mise à jour des métadonnées a échoué, utilisation des données en cache.

# Modules_ModuleBase_CantDisplayError
source: This module has encountered an error while running and was disabled. Please check the logs for more information.
es: Este módulo ha encontrado un error mientras se ejecutaba y fue desactivado. Por favor, compruebe los registros para obtener más información.
fr: Ce module a rencontré une erreur lors de son exécution et a été désactivé. Veuillez consulter les journaux pour plus d'informations.

# Modules_ModuleBase_FailedDraw
source: Failed to draw module {0}: {1}
es: Error al intentar mostrar el módulo {0}: {1}
fr: Échec de l'extraction du module {0} : {1}

# UI_MainWindow_DebugScreen_DetectedFriends
source: Detected Friends
es: Amigos detectados
fr: Amis détectés

# UI_MainWindow_DebugScreen_DetectedFriends_Usage
source: Click on a friend to copy their content id hash and salt
es: Haz clic en un amigo para copiar su content ID hash y sal
fr: Cliquez sur un ami pour copier le hachage et le sel de son identifiant

# UI_MainWindow_DebugScreen_DetectedFriends_Copied
source: Copied {0}'s data to clipboard
es: Copiados los datos de {0} al portapapeles
fr: Copie les données {0} dans le presse-papiers

# UI_MainWindow_ModuleScreen_SelectToView
source: Select a module to view its settings.
es: Seleccione un módulo para ver su configuración.
fr: Sélectionnez un module pour afficher ses paramètres.

# UI_MainWindow_SettingsScreen_RestartNeeded
source: One or more changes may require a plugin restart to take effect.
es: Uno o más cambios podrían requerir un reinicio del plugin para tener efecto.
fr: Un ou plusieurs changements peuvent nécessiter un redémarrage du plugin pour être pris en compte.

# UI_MainWindow_SettingsScreen_Setting_APIURL
source: API URL
es: URL de la API
fr: URL de l'API

# UI_MainWindow_SettingsScreen_Setting_APIURL_Invalid
source: Please enter a valid URL.
es: Por favor, introduce una URL válida.
fr: Saisissez une adresse URL valide.

# UI_MainWindow_SettingsScreen_Setting_APIURL_Description
source: This is the URL that the plugin will communicate with for API requests. Most users will not need to change this.
es: Esta es la URL con la que el plugin se comunicará para solicitudes de API. La mayoría de los usuarios no tendrán que cambiar esto.
fr: C'est l'URL avec laquelle le plugin communiquera pour les requêtes de l'API. La plupart des utilisateurs n'auront pas besoin de la changer.

# UI_MainWindow_Button_Modules
source: Modules
es: Módulos

# UI_MainWindow_Button_Settings
source: Settings
es: Ajustes
fr: Paramètres
zh: 设置

# UI_MainWindow_Button_Donate
source: Donate (Opens in browser)
es: Hacer una donación (Se abre en navegador web)
fr: Faire un don (s'ouvre dans le navigateur)

# UI_MainWindow_Button_Debug
source: Debug
es: Informes de Errores (Debug)
fr: Débogage

# Modules_LoginStateModule_UI_EventSettings
source: Event Settings
es: Configuración de eventos
fr: Paramètres d'événement

# Modules_LoginStateModule_UI_EventSettings_ReceieveEvents
source: Receive Events
es: Recibir eventos
fr: Réception d'événements

# Modules_LoginStateModule_UI_EventSettings_ReceieveEvents_Description
source: Whether or not to receive events from other friends.
es: Esto determina si quieres recibir eventos de otros amigos o no.
fr: Recevoir ou non des événements d'autres amis.

# Modules_PlayerStreamConnectionModule_ConnectionStatus_Exception
source: Error
fr: Erreur

# Modules_CurrentFriendsOnlineModule_UI_SendFriendCount_Description
source: Sends a message in chat showing how many friends are online when you log in to a character. Friends that are on different worlds than you will not be included.
zh: Sends a message in chat showing how many friends are online when you log in to a character. Friends that are on different worlds than you may not always be included.
